import style from './index.module.scss'
import RWDBurger from '../../components/AdminPage/RWDBurger'
import MUIDataTable from "mui-datatables";

const columns = [
  '名稱', '地址', '類型',
  '權狀', '主建', '格局',
  '標籤', '單價', '總價'
]

const data = [
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ],
  [
    '東湖捷運站華廈美4房', '台北市內湖區東湖路113巷', '電梯大樓',
    '54.99', '35.73', '4房2廳2衛1陽台',
    '含車位,有陽台,低公設', '59.72', '2888'
  ]
]


const CasesContainer = () => {
  return (
    <div className={style.CasesContainer}>
      <RWDBurger />
      <div className={style.Title}>
        <span>案件列表</span>
      </div>

      <div className={style.Cases}>
        <div className={style.Container}>
          {/* <div className={style.test}>

          </div> */}
          <MUIDataTable
            title={'案件列表'}
            data={data}
            columns={columns}
            options={{
              filterType: 'checkbox',
              responsive: 'vertical',
              rowsPerPageOptions: [10]
            }}
          />
        </div>
      </div>

    </div >
  )
}

export default CasesContainer
